---
type: InstanceNode
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# InstanceNode

`Autodesk.Revit.DB.InstanceNode` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSymbolGeometryId | 2023 | `public SymbolGeometryId GetSymbolGeometryId ()` |